Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052DVL6B
mcu_data: ksdk2_0
processor_version: 4.0.0
board: IMXRT1050-EVKB
pin_labels:
- {pin_num: H5, pin_signal: GPIO_EMC_06, label: FLEXPWM2_PWMA0, identifier: FLEXPWM2_PWMA0}
- {pin_num: H3, pin_signal: GPIO_EMC_08, label: FLEXPWM2_PWMA1, identifier: FLEXPWM2_PWMA1}
- {pin_num: G1, pin_signal: GPIO_EMC_10, label: SAI2_RX_BCLK, identifier: SAI2_RX_BCLK}
- {pin_num: C4, pin_signal: GPIO_EMC_33, label: SAI3_RX_DATA, identifier: SAI3_RX_DATA}
- {pin_num: C3, pin_signal: GPIO_EMC_36, label: SAI3_TX_DATA, identifier: SAI3_TX_DATA}
- {pin_num: E4, pin_signal: GPIO_EMC_37, label: SAI3_MCLK, identifier: SAI3_MCLK}
- {pin_num: D6, pin_signal: GPIO_EMC_38, label: SAI3_TX_BCLK, identifier: SAI3_TX_BCLK}
- {pin_num: B7, pin_signal: GPIO_EMC_39, label: SAI3_TX_SYNC, identifier: SAI3_TX_SYNC}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: GPIO_SW1, identifier: GPIO_SW1}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: GPIO_SW2, identifier: GPIO_SW2}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: SAI1_RX_DATA1, identifier: SAI1_RX_DATA1}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: SAI1_RX_DATA2, identifier: SAI1_RX_DATA2}
- {pin_num: C10, pin_signal: GPIO_B0_12, label: SAI1_RX_DATA3, identifier: SAI1_RX_DATA3}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: SAI1_MCLK, identifier: SAI1_MCLK}
- {pin_num: E10, pin_signal: GPIO_B0_14, label: SAI1_RX_SYNC, identifier: SAI1_RX_SYNC}
- {pin_num: E11, pin_signal: GPIO_B0_15, label: SAI1_RX_BCLK, identifier: SAI1_RX_BCLK}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: SAI1_RX_DATA0, identifier: SAI1_RX_DATA0}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: ENET_REF_CLK, identifier: ENET_REF_CLK}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: BT_REG_ON, identifier: BT_REG_ON}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: BT_HOST_WAKE, identifier: BT_HOST_WAKE}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: FLEXPWM2_PWMA3, identifier: FLEXPWM2_PWMA3}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: LPSPI3_SDO, identifier: LPSPI3_SDO}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: LPUART6_TX, identifier: LPUART6_TX}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: LPUART6_RX, identifier: LPUART6_RX}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: BOOT_MODE0, identifier: BOOT_MODE0}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: Flash_RST, identifier: Flash_RST}
- {pin_num: E14, pin_signal: GPIO_AD_B0_06, label: SWD_DIO, identifier: SWD_DIO}
- {pin_num: F12, pin_signal: GPIO_AD_B0_07, label: SWD_CLK, identifier: SWD_CLK}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: SAI2_RX_DATA, identifier: SAI2_RX_DATA}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: JTAG_TDI, identifier: JTAG_TDI}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: JTAG_TDO, identifier: JTAG_TDO}
- {pin_num: G10, pin_signal: GPIO_AD_B0_11, label: JTAG_nTRST, identifier: JTAG_nTRST}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: BT_UART1_TXD, identifier: BT_UART1_TXD}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: BT_UART1_RXD, identifier: BT_UART1_RXD}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: BT_UART1_CTS, identifier: BT_UART1_CTS}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: BT_UART1_RTS, identifier: BT_UART1_RTS}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: LPI2C1_SCL, identifier: LPI2C1_SCL}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: LPI2C1_SDA, identifier: LPI2C1_SDA}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: SAI3_OUT_SELECT, identifier: SAI3_OUT_SELECT}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: SAI3_GPIO_INT, identifier: SAI3_GPIO_INT}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: LPSPI3_PCS0, identifier: LPSPI3_PCS0}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: LPSPI3_SDI, identifier: LPSPI3_SDI}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: SAI3_GPIO_RST, identifier: SAI3_GPIO_RST}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: LPSPI3_SCK, identifier: LPSPI3_SCK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: WL_SD1_CMD, identifier: WL_SD1_CMD}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: WL_SD1_CLK, identifier: WL_SD1_CLK}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: WL_SD1_DATA0, identifier: WL_SD1_DATA0}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: WL_SD1_DATA1, identifier: WL_SD1_DATA1}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: WL_SD1_DATA2, identifier: WL_SD1_DATA2}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: WL_SD1_DATA3, identifier: WL_SD1_DATA3}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: FlexSPI_D7_A, identifier: FlexSPI_D7_A}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: FlexSPI_D6_A, identifier: FlexSPI_D6_A}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: FlexSPI_D5_A, identifier: FlexSPI_D5_A}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: FlexSPI_D4_A, identifier: FlexSPI_D4_A}
- {pin_num: L6, pin_signal: WAKEUP, label: WL_HOST_WAKE, identifier: WL_HOST_WAKE}
- {pin_num: K7, pin_signal: PMIC_ON_REQ, label: WL_REG_ON, identifier: WL_REG_ON}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitSwitches();
    BOARD_InitMicrophone();
    BOARD_InitEthernet();
    BOARD_InittJtag();
    BOARD_InitLPI2C();
    BOARD_InitLPSPI();
    BOARD_InitLPUART();
    BOARD_InitBootConfig();
    BOARD_InitWifi();
    BOARD_InitBluetooth();
    BOARD_InitAudioOut();
    BOARD_InitLED();
}

