Music802/embedded-wifi_alexa_4_buffer_record/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMicrophone
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMicrophone(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_08_SAI2_RX_DATA,      /* GPIO_AD_B0_08 is configured as SAI2_RX_DATA */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_10_SAI1_TX_DATA03,       /* GPIO_B0_10 is configured as SAI1_TX_DATA03 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B0_10 */
#if 0
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_11_SAI1_TX_DATA02,       /* GPIO_B0_11 is configured as SAI1_TX_DATA02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B0_11 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_12_SAI1_TX_DATA01,       /* GPIO_B0_12 is configured as SAI1_TX_DATA01 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B0_12 */
#else
  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_11_GPIO2_IO11,       /* GPIO_B0_11 is configured as SAI1_TX_DATA02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B0_11 */
  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_12_GPIO2_IO12,       /* GPIO_B0_12 is configured as SAI1_TX_DATA01 */
      1U);
#endif
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_13_SAI1_MCLK,            /* GPIO_B0_13 is configured as SAI1_MCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_14_SAI1_RX_SYNC,         /* GPIO_B0_14 is configured as SAI1_RX_SYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B0_15_SAI1_RX_BCLK,         /* GPIO_B0_15 is configured as SAI1_RX_BCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_00_SAI1_RX_DATA00,       /* GPIO_B1_00 is configured as SAI1_RX_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_10_SAI2_RX_BCLK,        /* GPIO_EMC_10 is configured as SAI2_RX_BCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_08_SAI2_RX_DATA,      /* GPIO_AD_B0_08 PAD functional properties : */
      0xB0u);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Disabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_10_SAI1_TX_DATA03,       /* GPIO_B0_10 PAD functional properties : */
      0xB0u);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Disabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
#if 0
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_11_SAI1_TX_DATA02,       /* GPIO_B0_11 PAD functional properties : */
      0xB0u);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Disabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_12_SAI1_TX_DATA01,       /* GPIO_B0_12 PAD functional properties : */
      0xB0u);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Disabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
#else
    IOMUXC_SetPinConfig(
    		IOMUXC_GPIO_B0_11_GPIO2_IO11,       /* GPIO_B0_11 PAD functional properties : */
			0xB0u);
    IOMUXC_SetPinConfig(
    		IOMUXC_GPIO_B0_12_GPIO2_IO12,       /* GPIO_B0_12 PAD functional properties : */
			0xB0u);
#endif
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_13_SAI1_MCLK,            /* GPIO_B0_13 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_14_SAI1_RX_SYNC,         /* GPIO_B0_14 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B0_15_SAI1_RX_BCLK,         /* GPIO_B0_15 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_00_SAI1_RX_DATA00,       /* GPIO_B1_00 PAD functional properties : */
      0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_10_SAI2_RX_BCLK,        /* GPIO_EMC_10 PAD functional properties : */
      0x10A1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/4
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
}


